server/src/__tests__/load/artillery.config.yml
# Artillery 全局配置
# 用法: artillery run -c src/__tests__/load/artillery.config.yml src/__tests__/load/scenarios/xxx.yml
config:
  target: "http://localhost:3001"
  plugins:
    expect: {}
    ensure: {}
  ensure:
    thresholds:
      - http.response_time.p99: 5000
      - http.response_time.p95: 3000
  payload:
    path: "processors/auth-processor.js"
    name: "authPayloads"
    fields:
      - "username"
      - "password"
  processor: "processors/auth-processor.js"
  phases:
    - name: "warmup"
      duration: 10
      arrivalRate: 5
    - name: "ramp"
      duration: 30
      arrivalRate: 20
    - name: "sustain"
      duration: 60
      arrivalRate: 20